#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include<string.h>
//int main()
//{
	/*int num1 = 0;
	int num2 = 0;
	int sum = 0;
	scanf("%d%d", &num1, &num2);
	sum = num1 + num2;
	printf("sum=%d\n", sum);


	int num = 4;
	printf("%d\n", num);*/


	/*char arr1[] = "abc";
	char arr2[] = { 'a','b','c','\0'};数组应以\0结束，否则烫烫烫。
	printf("%s\n", arr1);
	printf("%s\n", arr2);*/


	/*char arr1[] = "abc";
	char arr2[] = { 'a','b','c' };
	printf("%d\n", strlen(arr1));
	printf("%d\n", strlen(arr2));*/
	

	//printf("(are you ok??)\n");
	// 1.转义字符 "\" :用在字符前转义为某一固定意义的字符。
	// 反转义"\\":让斜杠不再转义。
	// \ddd:三个八进制数字 八进制转化为十进制的数字若为ASCII码值（如65、90、97分别为为A、Z、a字符），则输出对应的字符。
	// \xdd:x后接两个十六进制数字。


	/*int line = 0;
	int input = 0;
	printf("你要开始敲代码不？（1/0）\n");
	scanf("%d", &input);
	if (input == 1) 
	{
		printf("开始敲代码\n");

		while (line < 20000)
		{
			printf("掉头发:%d\n", line);
			line++;
		}
		if (line >= 20000)
			printf("变成大牛\n");
	}
	else
		printf("变成咸鱼\n");*/

	
	/*int arr[10]={1,2,3,4,5,6,7,8,9,10}*/
	//定义存放10个整型数字的数组，每个数字都有下标默认从0开始。


	// << >>左移位 右移（二进制）位

	/*
	&    按位与     对应同为1 异为0               
	|    按位或     对应有1为1
	^    按位异或   对应同为0 异为1
	*/

	// = 赋值  == 判断相等   a = a+10 等价 a += 10(复合赋值符)

	//c语言中 0为假 非0为真    ！（逻辑反操作）真假互换
	//单、双、三目操作符   -1；-为单目操作符      a+b; + 为双目操作符
	//sizeof 计算变量（可以不用括号）/类型（要有括号）所占空间，单位是字节
	

	//int a = 10;
	//int arr[] = { 1,2,3,4,5,6 };//6*4-24 -> int [6]
	//printf("%d\n", sizeof(a));//4
	//printf("%d\n", sizeof(int));//4
	//printf("%d\n", sizeof a);//4
	////printf("d\n", sizeof int);//error
	//printf("%d\n", sizeof(arr));//计算数组大小，单位是字节
	//printf("%d\n", sizeof(arr) / sizeof(arr[0]));//计算数组内字符个数

	//int a = 0;//4个字节， 32bit位
	//int b = ~a;//b是有符号的整形
	//~ 按(2进制)位取反
	//00000000000000000000000000000000
	//11111111111111111111111111111111
	//有符号数 最高位的地方代表符号 1为负数 0为正数
	//整数内存存储都是补码，正数原码、反码、补码相同。
	//原码(直接按正负写的二进制序列)    --->    
	//反码(原码的符号位不变其他位按位取反)    --->    
	//补码(反码+1)
	//负数在内存中存储的时候，存储的是二进制的补码
	//11111111111111111111111111111111补码
	//11111111111111111111111111111110反码
	//00000000000000000000000000000001原码
	//printf("%d\n"，b);//使用的，打印的是这个数的原码

	/*int a = 10;
	int b = a--;后置++/-- 先使用，再++/--
	int b = --a;前置++/-- 先++ / --，再使用
	printf("a=%db=%d\n", a, b);*/

	//（类型）强制类型转换

	//&&逻辑与 有假为假 同真为真
	//||逻辑或 有真为真 同假为假

	//exp1 ? exp2 : exp3 三目操作符

	//int arr[10] = { 0 };
	//arr[4];//下标引用操作符
	//( )函数引用操作符

	//& * . ->

//viod test()
//{
//	static int a = 1;//a 是一静态的局部变量
//	a++;
//	printf("a = %d\n",a);
//}
//int main()
//{
//	int i = 0;
//	while (i<5)
//	{
//		test();
//		i++;
//	}
//	return 0;
//}

//static 修饰局部变量
//局部变量的生命周期变长；
//static 修饰全局变量
//改变了变量的作用域 - 让静态的全局变量只能在自己所在的源文件内部使用
//出了源文件就没法再使用了
//static修饰函数改变了函数的链接属性（函数本身具有外部链接属性 被修饰则具有内部链接属性）

//#define 定义标识符常量/宏（带参数）

//int main()
//{
//	int a = 10;
//	&a;// & 取地址操作符
//	int*p = a;// * 解引用操作符
//	printf("%p\n", p);
//	printf("%d\n", sizeof (p));
//	return 0;
//}



